<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads the latest Intellij disk image and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.facebook.autopkg.munki.intellij</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Intellij</string>
			<key>NAME</key>
			<string>Intellij</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
					<string>okt_catalog</string>
				</array>
				<key>category</key>
				<string>Developer</string>
				<key>description</key>
				<string>Community Edition is free and open-source, licensed under Apache 2.0. It provides all the basic features for JVM and Android development.
&lt;br&gt;&lt;br&gt; &lt;img src="https://raw.githubusercontent.com/GiafarOKTANAIT/recipes_okt/main/artwork/intellij.png"&gt;</string>
				<key>developer</key>
				<string>Intellij</string>
				<key>display_name</key>
				<string>Intellij Community Edition</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.facebook.autopkg.download.intellij</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
				<key>Arguments</key>
				<dict>
					<key>warning_message</key>
					<string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
