<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Oktana v1.0 (https://github.com/GiafarOKTANAIT/recipes_okt)</string>
	<key>Description</key>
	<string>Downloads the latest version of Acrobat Reader and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.GiafarOKTANAIT.munki.AcrobatReader</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Adobe Acrobat Reader</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Acrobat Reader</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Acrobat Update Helper.app</string>
				<string>Adobe Acrobat Reader.app</string>
				<string>Adobe Acrobat Updater.app</string>
				<string>AcroInstallAlert.app</string>
				<string>NativeMessagingHost.app</string>
				<string>RdrServicesUpdater.app</string>
			</array>
			<key>catalogs</key>
			<array>
					<string>testing</string>
					<string>okt_catalog</string>
					<key>category</key>
					<string>Designer</string>
			</array>
			<key>description</key>
			<string>Adobe® Reader® is the global standard for reliably viewing, printing, and commenting on PDF documents. It's the only PDF file viewer that can open and interact with all types of PDF content, including forms and multimedia.
&lt;br&gt;&lt;br&gt; &lt;img src="https://raw.githubusercontent.com/GiafarOKTANAIT/recipes_okt/main/artwork/adobereader.png"&gt;
</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Reader</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.GiafarOKTANAIT.download.AcrobatReader</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
