<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Figma.
		url for x86: https://www.sublimetext.com/download_thanks?target=mac
		url for arm64: https://www.sublimetext.com/download_thanks?target=mac
	</string>
	<key>Identifier</key>
	<string>com.github.GiafarOKTANAIT.download.SublimeText4</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SublimeText4</string>
		<key>url</key>
		<string>https://www.sublimetext.com/download_thanks?target=mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>