<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Tableau and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.GiafarOKTANAIT.munki.Tableau</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Tableau Desktop 2022.4</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Tableau</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Tableau Desktop 2022.4.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
				<string>okt_catalog</string>
			</array>
			<key>category</key>
			<string>Salesforce</string>
			<key>description</key>
			<string>Live Visualization &amp; Interactive Dashboards Reveal Hidden Insights. Try it Free! Free Training. Mobile Analytics. Big Data Analytics. Drag &amp; Drop.
&lt;br&gt;&lt;br&gt; &lt;img src="https://raw.githubusercontent.com/GiafarOKTANAIT/recipes_okt/main/artwork/tableu.png"&gt;</string>
			<key>developer</key>
			<string>Salesforce</string>
			<key>display_name</key>
			<string>Tableau Public</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.GiafarOKTANAIT.download.Tableau</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
