<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>giafarmaldonado</string>
		<key>creation_date</key>
		<date>2022-11-29T19:43:06Z</date>
		<key>munki_version</key>
		<string>6.0.1.4523</string>
		<key>os_version</key>
		<string>12.6.1</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>category</key>
	<string>Communication</string>
	<key>description</key>
	<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
	<key>developer</key>
	<string>Slack</string>
	<key>display_name</key>
	<string>Slack</string>
	<key>installer_item_hash</key>
	<string>b52efac1242180f2fde5b4cde015261c2ab6404a895dc13ba9ef7ac60573d593</string>
	<key>installer_item_location</key>
	<string>apps/Slack-4.29.149.dmg</string>
	<key>installer_item_size</key>
	<integer>159162</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.tinyspeck.slackmacgap</string>
			<key>CFBundleName</key>
			<string>Slack</string>
			<key>CFBundleShortVersionString</key>
			<string>4.29.149</string>
			<key>CFBundleVersion</key>
			<string>429000149</string>
			<key>minosversion</key>
			<string>10.14</string>
			<key>path</key>
			<string>/Applications/Slack.app</string>
			<key>type</key>
			<string>application</string>
			<key>version_comparison_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>Slack.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.14</string>
	<key>name</key>
	<string>Slack</string>
	<key>unattended_install</key>
	<true/>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>4.29.149</string>
</dict>
</plist>
