<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Virtual Meetings</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.zoom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zoom</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://zoom.us/support/download</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		    <key>Arguments</key>
		    <dict>
			<key>input_path</key>
			<string>%pathname%/Zoom.app</string>
			<key>requirement</key>
		    </dict>
		    <key>Processor</key>
		    <string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>