<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Oktana v1.0 (https://github.com/GiafarOKTANAIT/recipes_okt)</string>
	<key>Description</key>
	<string>Downloads the latest version of the Zoom (Mac) application and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.GiafarOKTANAIT.munki.Zoom</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Zoom</string>
		<key>NAME</key>
		<string>Zoom</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Zoom.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
				<string>okt_catalog</string>
			</array>
			<key>category</key>
			<string>Chatter</string>
			<key>description</key>
			<string>Zoom is for you. We're here to help you connect, communicate, and express your ideas so you can get more done together. We're proud to be trusted by millions of enterprises, small businesses, and individuals, just like you.
&lt;br&gt;&lt;br&gt; &lt;img src="https://raw.githubusercontent.com/GiafarOKTANAIT/recipes_okt/main/artwork/zoom.png"&gt;</string>
			<key>developer</key>
			<string>Zoom Video Communications, Inc.</string>
			<key>display_name</key>
			<string>Zoom</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.GiafarOKTANAIT.download.Zoom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
