<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of RustDesk.</string>
	<key>Identifier</key>
	<string>com.github.GiafarOKTANAIT.download.RustDesk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RustDesk</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://objects.githubusercontent.com/github-production-release-asset-2e65be/299354207/3331b92d-a9ce-4ae2-9d61-e1c39c4c5e6f?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230222%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20230222T190723Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=234f916af7a05461036a05b77a12d07f3bc2472724245d554ebcffe2d0911a3c&amp;X-Amz-SignedHeaders=host&amp;actor_id=96845641&amp;key_id=0&amp;repo_id=299354207&amp;response-content-disposition=attachment%3B%20filename%3Drustdesk-1.1.9.dmg&amp;response-content-type=application%2Foctet-stream</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/RustDesk.app</string>
				<key>requirement</key>
				<string>identifier rustdesk and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = HZF9JMC8YN</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/RustDesk.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
