<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Control remotly a desktop</string>
	<key>Identifier</key>
	<string>com.github.jpiel.munki.Anydesk</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Admin Utils</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>app</string>
		<key>pkginfo</key>
		<dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Connect to a computer remotely, be it from the other end of the office or halfway around the world.
            AnyDesk ensures secure and reliable remote desktop connections for IT professionals and on-the-go
            individuals alike.</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Anydesk</string>
            <key>name</key>
            <string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.Anydesk</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>